odIfcInitModelerGeometry(ModelerType)
\details
Initializes IFC SDK Modeler functionality.
\param modelerType[in] Modeler type which will be used to create geometry.
\returns Returns eOk if IFC SDK Modeler was successfully initialized; otherwise, the function returns an appropriate error code.